#+TITLE: Computational Linguistics Notes


* Normalizing the Vocabulary
*Case folding* is simply done with =.lower()=.

*Stemming* can be done manually for disregarding plural =s='s:
#+BEGIN_SRC python :tangle code/stemmer_plurals.py :exports both :results output
  import re

  def stem(phrase):
	  return ' '.join([re.findall('^(.*ss|.*?)(s)?$', word)[0][0].strip("'")
			   for word in phrase.lower().split()])

  print("Stemming plurals for 'houses' gives: ", end="")
  print(stem('houses'))
  print("Stemming plurals from 'Doctor House's Calls' gives: ", end="")
  print(stem("Doctor House's calls"))
#+END_SRC

This gives:
#+RESULTS:
: Stemming plurals for 'houses' gives: house
: Stemming plurals from 'Doctor House's Calls' gives: doctor house call

NLTK's =PorterStemmer= works like this:
#+BEGIN_SRC python :tangle code/stemmer_nltk_porter.py :exports both :results output
  from nltk.stem.porter import PorterStemmer

  stemmer = PorterStemmer()
  print("Porter Stemmer for 'Dish washer's washed dishes' gives:")
  print(' '.join([stemmer.stem(w).strip("'") for w in
				  "Dish washer's washed dishes".split()]))
#+END_SRC

#+RESULTS:
: Porter Stemmer for 'Dish washer's washed dishes' gives:
: dish washer wash dish

The Porter Stemmer has been ported to pure Python [[https://github.com/jedijulia/porter-stemmer][here]]. The basic steps
are the following:
- *Step 1a*: remove "s" and "es" endings;
- *Step 1b*: remove "ed", "ing" and "at" endings;
- *Step 1c*: remove "y" endings;
- *Step 2*: /nounifying/ endings such as "(a)tional", "ence", "able";
- *Step 3*: adjective endings such as "icate", "ful", "alize";
- *Step 4*: adjectives and nound endings such as "ive", "ible", "ent", "ism";
- *Step 5a*: some "e" endings still left around;
- *Step 5b*: trailing double consonants for which the stem should end in one consonant.

*Lemmatization* is done readily with NLTK:
#+BEGIN_SRC python :tangle code/lemmatizer_nltk.py :exports both :results output
  import nltk
  nltk.download('wordnet')
  from nltk.stem import WordNetLemmatizer

  lemmatizer = WordNetLemmatizer()
  adjectives = ["better", "good", "goods", "best"]
  nouns = ["better", "goods", "goodness"]

  print("> We lemmatize the following adjectives:")
  for adj in adjectives:
	  print(adj, end=" ")
  print("\n> And get respectively:")
  for adj in adjectives:
	  print(lemmatizer.lemmatize(adj, pos="a"), end=" ")

  print("\n> Now the following nouns:")
  for n in nouns:
	  print(n, end=" ")
  print("\n> And get respectively:")
  for n in nouns:
	  print(lemmatizer.lemmatize(n, pos="n"), end=" ")
#+END_SRC

This gives:
#+RESULTS:
: > We lemmatize the following adjectives:
: better good goods best 
: > And get respectively:
: good good goods best 
: > Now the following nouns:
: better goods goodness 
: > And get respectively:
: better good goodness 

** Example: IDF
#+BEGIN_SRC python :tangle code/idf_example.py :exports both :results output
  from collections import OrderedDict, Counter
  from nltk.tokenize import TreebankWordTokenizer
  tokenizer = TreebankWordTokenizer()

  from nlpia.data.loaders import kite_text, kite_history

  kite_intro = kite_text.lower()
  intro_tokens = tokenizer.tokenize(kite_intro)
  kite_history = kite_history.lower()
  history_tokens = tokenizer.tokenize(kite_history)

  intro_total = len(intro_tokens)
  print("The kite text contains " + str(intro_total) + " tokens")
  history_total = len(history_tokens)
  print("The kite history contains " + str(history_total) + " tokens")

  intro_tf = {}
  history_tf = {}
  intro_counts = Counter(intro_tokens)
  intro_tf['kite'] = intro_counts['kite'] / intro_total
  history_counts = Counter(history_tokens)
  history_tf['kite'] = history_counts['kite'] / history_total
  print("Term frequency of 'kite' in intro is " + str(round(intro_tf['kite'], 4)))
  print("Term frequency of 'kite' in history is " + str(round(history_tf['kite'], 4)))

  # maybe the counts are not that relevant compared to 'and'
  intro_tf['and'] = intro_counts['and'] / intro_total
  history_tf['and'] = history_counts['and'] / history_total
  print("Term frequency of 'and' in intro is " + str(round(intro_tf['and'], 4)))
  print("Term frequency of 'and' in history is " + str(round(history_tf['and'], 4)))

  # let's use rarity for IDF
  num_docs_containing_and = 0
  for doc in [intro_tokens, history_tokens]:
	  if 'and' in doc:
		  num_docs_containing_and += 1

  num_docs_containing_kite = 0
  for doc in [intro_tokens, history_tokens]:
	  if 'kite' in doc:
		  num_docs_containing_kite += 1

  num_docs_containing_china = 0
  for doc in [intro_tokens, history_tokens]:
	  if 'china' in doc:
		  num_docs_containing_china += 1

  # TF of "China"
  intro_tf['china'] = intro_counts['china'] / intro_total
  history_tf['china'] = history_counts['china'] / history_total

  # IDF
  num_docs = 2
  intro_idf = {}
  history_idf = {}

  intro_idf['and'] = num_docs / num_docs_containing_and
  intro_idf['kite'] = num_docs / num_docs_containing_kite
  intro_idf['china'] = num_docs / num_docs_containing_china

  history_idf['and'] = num_docs / num_docs_containing_and
  history_idf['kite'] = num_docs / num_docs_containing_kite
  history_idf['china'] = num_docs / num_docs_containing_china

  # TF-IDF
  intro_tfidf = {}
  intro_tfidf['and'] = intro_tf['and'] * intro_idf['and']
  intro_tfidf['kite'] = intro_tf['kite'] * intro_idf['kite']
  intro_tfidf['china'] = intro_tf['china'] * intro_idf['china']

  history_tfidf = {}
  history_tfidf['and'] = history_tf['and'] * history_idf['and']
  history_tfidf['kite'] = history_tf['kite'] * history_idf['kite']
  history_tfidf['china'] = history_tf['china'] * history_idf['china']

  # example prints
  print("TF-IDF for 'kite' in intro text is " + str(round(intro_tfidf['kite'], 4)))
  print("TF-IDF for 'kite' in history text is " + str(round(history_tfidf['kite'], 4)))
#+END_SRC

#+RESULTS:
: The kite text contains 363 tokens
: The kite history contains 297 tokens
: Term frequency of 'kite' in intro is 0.0441
: Term frequency of 'kite' in history is 0.0202
: Term frequency of 'and' in intro is 0.0275
: Term frequency of 'and' in history is 0.0303
: TF-IDF for 'kite' in intro text is 0.0441
: TF-IDF for 'kite' in history text is 0.0202

**** Example: SVD and PCA on Spam SMS
#+BEGIN_SRC python :tangle code/svd_pca_spam_example.py :exports both :results output
  import pandas as pd
  from nlpia.data.loaders import get_data

  pd.options.display.width = 120          # better printing of DataFrame
  sms = get_data('sms-spam')

  # add '!' to spam messages for easy spotting
  index = ['sms{}{}'.format(i, '!'*j)
		   for (i, j) in zip(range(len(sms)), sms.spam)]
  print("> Some messages:")
  print(sms.head(6))

  # calculate TF-IDF vectors for each message
  from sklearn.feature_extraction.text import TfidfVectorizer
  from nltk.tokenize.casual import casual_tokenize

  tfidf = TfidfVectorizer(tokenizer=casual_tokenize)
  tfidf_docs = tfidf.fit_transform(raw_documents=sms.text).toarray()
  print("> Vocabulary for messages: " + str(len(tfidf.vocabulary_)))

  tfidf_docs = pd.DataFrame(tfidf_docs)
  # center the vectorized documents by subtracting the mean
  tfidf_docs = tfidf_docs - tfidf_docs.mean()

  print("> The array is now " + str(tfidf_docs.shape))
  print("> There are " + str(sms.spam.sum()) + " messages marked as spam")

  # let's now use PCA
  from sklearn.decomposition import PCA

  pca = PCA(n_components=16)
  pca = pca.fit(tfidf_docs)
  pca_topic_vectors = pca.transform(tfidf_docs)
  columns = ['topic{}'.format(i) for i in range(pca.n_components)]
  pca_topic_vectors = pd.DataFrame(pca_topic_vectors, \
								   columns=columns, index=index)
  print("> PCA topic matrix (first 6):")
  print(pca_topic_vectors.round(3).head(6))

  # sort the vocabulary by term count
  column_nums, terms = zip(*sorted(zip(tfidf.vocabulary_.values(),
									   tfidf.vocabulary_.keys())))

  # now show the terms contained
  weights = pd.DataFrame(pca.components_, columns=terms,
						 index = ['topic{}'.format(i) for i in range(16)])
  pd.options.display.max_columns = 8
  print(weights.head(4).round(3))

  # some are uninteresting, so let's focus on some terms
  pd.options.display.max_columns = 12
  deals = weights['! ;) :) half off free crazy deal \
  only $ 80 %'.split()].round(3) * 100

  print(deals)

  # let's see how many topics are about these "deals"
  print(deals.T.sum())

  # now use truncated SVD to keep just the 16 most interesting topics
  from sklearn.decomposition import TruncatedSVD

  svd = TruncatedSVD(n_components=16, n_iter=100)
  svd_topic_vectors = svd.fit_transform(tfidf_docs.values)
  svd_topic_vectors = pd.DataFrame(svd_topic_vectors, columns=columns,
								   index=index)
  print("> SVD Topic Vectors:")
  print(svd_topic_vectors.round(3).head(6))
  # which are the same as PCA, given the n_iter = 100 (large)

  # evaluate performance:
  # compute the dot product for the first 6 topic vectors
  # if cosine similarity is large wrt spam messages, it's OK
  import numpy as np
  svd_topic_vectors = (svd_topic_vectors.T /
					   np.linalg.norm(svd_topic_vectors, axis=1)).T
  print("> Notice cosine similarity wrt spam messages:")
  print(svd_topic_vectors.iloc[:10].dot(svd_topic_vectors.iloc[:10].T).round(1))
#+END_SRC

#+RESULTS:
#+begin_example
> Some messages:
   spam                                               text
0     0  Go until jurong point, crazy.. Available only ...
1     0                      Ok lar... Joking wif u oni...
2     1  Free entry in 2 a wkly comp to win FA Cup fina...
3     0  U dun say so early hor... U c already then say...
4     0  Nah I don't think he goes to usf, he lives aro...
5     1  FreeMsg Hey there darling it's been 3 week's n...
> Vocabulary for messages: 9232
> The array is now (4837, 9232)
> There are 638 messages marked as spam
> PCA topic matrix (first 6):
       topic0  topic1  topic2  topic3  ...  topic12  topic13  topic14  topic15
sms0    0.201   0.003   0.037   0.011  ...    0.006   -0.041    0.002    0.033
sms1    0.404  -0.094  -0.077   0.051  ...    0.045   -0.016    0.050   -0.035
sms2!  -0.030  -0.048   0.090  -0.067  ...    0.031   -0.023   -0.032    0.063
sms3    0.329  -0.033  -0.035  -0.016  ...    0.074   -0.045    0.027   -0.083
sms4    0.002   0.031   0.038   0.034  ...    0.027    0.030   -0.077   -0.027
sms5!  -0.016   0.059   0.014  -0.006  ...   -0.045    0.066   -0.001    0.008

[6 rows x 16 columns]
            !      "      #   #150  ...      …      ┾    〨ud      鈥
topic0 -0.071  0.008 -0.001 -0.000  ... -0.002  0.001  0.001  0.001
topic1  0.063  0.008  0.000 -0.000  ...  0.003  0.001  0.001  0.001
topic2  0.071  0.027  0.000  0.001  ...  0.002 -0.001 -0.001 -0.001
topic3 -0.059 -0.032 -0.001 -0.000  ...  0.001  0.001  0.001  0.001

[4 rows x 9232 columns]
            !   ;)    :)  half  off  free  crazy  deal  only    $   80    %
topic0   -7.1  0.1  -0.5  -0.0 -0.4  -2.0   -0.0  -0.1  -2.2  0.3 -0.0 -0.0
topic1    6.3  0.0   7.4   0.1  0.4  -2.3   -0.2  -0.1  -3.8 -0.1 -0.0 -0.2
topic2    7.1  0.2  -0.1   0.0  0.3   4.4    0.1  -0.1   0.7  0.0  0.0  0.1
topic3   -5.9 -0.3  -7.0   0.2  0.3  -0.2    0.0   0.1  -2.3  0.1 -0.1 -0.3
topic4   38.1 -0.1 -12.5  -0.1 -0.2   9.9    0.1  -0.2   3.0  0.3  0.1 -0.1
topic5  -26.5  0.1  -1.6  -0.3 -0.7  -1.4   -0.6  -0.2  -1.8 -0.9  0.0  0.0
topic6  -10.9 -0.5  19.8  -0.4 -0.9  -0.5   -0.2  -0.1  -1.4 -0.0 -0.0 -0.1
topic7   16.2  0.1 -17.8   0.8  0.8  -2.9    0.0   0.1  -1.8 -0.3  0.0 -0.1
topic8   34.3  0.1   5.2  -0.5 -0.5  -0.1   -0.4  -0.4   3.2 -0.6 -0.0 -0.2
topic9    7.5 -0.3  16.3   1.4 -0.9   6.1   -0.5  -0.4   3.1 -0.5 -0.0 -0.0
topic10 -31.9 -0.2 -10.3   0.1  0.1  12.1    0.1   0.0   0.2  0.0 -0.1 -0.2
topic11  21.6  0.4  30.9   0.5  1.4  -4.6    0.0   0.1   0.2 -0.4 -0.0 -0.3
topic12 -24.5 -0.2  35.3  -0.2  0.1  -3.9   -0.5   0.1   3.8  0.4 -0.0  0.3
topic13  12.0 -0.2  31.9  -0.2  0.5   5.8    0.4   0.2  -1.4 -0.4  0.0 -0.3
topic14  -2.8 -0.2  13.4  -0.3 -0.9   4.9    0.2  -0.1   4.2 -0.2  0.1 -0.4
topic15  -7.5 -0.4  -1.3   0.7 -1.2   1.3   -0.7   0.6   0.9 -0.4  0.0 -0.1
topic0    -11.9
topic1      7.5
topic2     12.7
topic3    -15.4
topic4     38.3
topic5    -33.9
topic6      4.8
topic7     -4.9
topic8     40.1
topic9     31.8
topic10   -30.1
topic11    49.8
topic12    10.7
topic13    48.3
topic14    17.9
topic15    -8.1
dtype: float64
> SVD Topic Vectors:
       topic0  topic1  topic2  topic3  topic4  topic5  ...  topic10  topic11  topic12  topic13  topic14  topic15
sms0    0.201   0.003   0.037   0.011  -0.019  -0.053  ...    0.007   -0.007    0.002   -0.036   -0.014    0.037
sms1    0.404  -0.094  -0.078   0.051   0.100   0.047  ...   -0.004    0.036    0.043   -0.021    0.051   -0.042
sms2!  -0.030  -0.048   0.090  -0.067   0.091  -0.043  ...    0.125    0.023    0.026   -0.020   -0.042    0.052
sms3    0.329  -0.033  -0.035  -0.016   0.052   0.056  ...    0.022    0.023    0.073   -0.046    0.022   -0.070
sms4    0.002   0.031   0.038   0.034  -0.075  -0.093  ...    0.028   -0.009    0.027    0.034   -0.083   -0.021
sms5!  -0.016   0.059   0.014  -0.006   0.122  -0.040  ...    0.041    0.055   -0.037    0.075   -0.001    0.020

[6 rows x 16 columns]
> Notice cosine similarity wrt spam messages:
       sms0  sms1  sms2!  sms3  sms4  sms5!  sms6  sms7  sms8!  sms9!
sms0    1.0   0.6   -0.1   0.6  -0.0   -0.3  -0.3  -0.1   -0.3   -0.3
sms1    0.6   1.0   -0.2   0.8  -0.2    0.0  -0.2  -0.2   -0.1   -0.1
sms2!  -0.1  -0.2    1.0  -0.2   0.1    0.4   0.0   0.3    0.5    0.4
sms3    0.6   0.8   -0.2   1.0  -0.2   -0.3  -0.1  -0.3   -0.2   -0.1
sms4   -0.0  -0.2    0.1  -0.2   1.0    0.2   0.0   0.1   -0.4   -0.2
sms5!  -0.3   0.0    0.4  -0.3   0.2    1.0  -0.1   0.1    0.3    0.4
sms6   -0.3  -0.2    0.0  -0.1   0.0   -0.1   1.0   0.1   -0.2   -0.2
sms7   -0.1  -0.2    0.3  -0.3   0.1    0.1   0.1   1.0    0.1    0.4
sms8!  -0.3  -0.1    0.5  -0.2  -0.4    0.3  -0.2   0.1    1.0    0.3
sms9!  -0.3  -0.1    0.4  -0.1  -0.2    0.4  -0.2   0.4    0.3    1.0
#+end_example
